app/views/treino_exercicios/_form.html.erb

            <%= form.label :treino_id %>
            <%= form.select :treino_id, options_for_select(@treinos.collect { | treino | [Usuario.find(treino.aluno_id).nome, treino.id] }), {}, {} %>
---
SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]