app/views/treinos/index.html.erb

SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
---
          <td><%= treino.quantidade_dias %></td>
          <% usuario_aluno = Usuario.find(treino.aluno_id) %>
          <% usuario_professor = Usuario.find(treino.professor_id) %>