app/views/treinos/show.html.erb

  <strong>Aluno:</strong>
  <%= Usuario.find(@treino.aluno_id).nome %>
---
SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]

  <strong>Professor:</strong>
  <%= Usuario.find(@treino.professor_id).nome %>
---
SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]