app/helpers/sessions_helper.rb

  def current_user
    @current_user ||= Usuario.find_by(id: session[:usuario_id])
---
SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]