app/views/usuarios/show_aluno.html.erb

    <strong>Professor:</strong>
    <%= Usuario.find(treino.professor_id).nome %>
---
SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]