app/views/usuarios/show_professor.html.erb

SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    <strong>Professor:</strong>
    <%= Usuario.find(treino.professor_id).nome %>