app/controllers/application_controller.rb

SELECT "usuarios".* FROM "usuarios" WHERE "usuarios"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def correct_user?
    if logged_in?
      @usuario = Usuario.find(params[:id])