app/controllers/exercicios_controller.rb

SELECT "exercicios".* FROM "exercicios"
---
  def index
    @exercicios = Exercicio.all

INSERT INTO "exercicios" ("nome", "grupo_muscular", "descricao", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["nome", "teste"], ["grupo_muscular", "vai ai"], ["descricao", "pfvrr"], ["created_at", "2020-10-12 01:54:20.037172"], ["updated_at", "2020-10-12 01:54:20.037172"]]
---
  def create
    @exercicio = Exercicio.new(exercicio_params)

    respond_to do |format|
      if @exercicio.save

UPDATE "exercicios" SET "nome" = ?, "updated_at" = ? WHERE "exercicios"."id" = ?  [["nome", "Crucificado"], ["updated_at", "2020-10-08 17:45:28.349622"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @exercicio.update(exercicio_params)

DELETE FROM "exercicios" WHERE "exercicios"."id" = ?  [["id", 1]]
---
  def destroy
    @exercicio.destroy

SELECT "exercicios".* FROM "exercicios" WHERE "exercicios"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_exercicio
      @exercicio = Exercicio.find(params[:id])