app/controllers/treino_exercicios_controller.rb

  def index
    @treino_exercicio = TreinoExercicio.all
---
SELECT "treino_exercicios".* FROM "treino_exercicios"

  def new
    @treino_exercicio = TreinoExercicio.new
    @treinos = Treino.all
    @exercicios = Exercicio.all
---
SELECT "treinos".* FROM "treinos"
SELECT "exercicios".* FROM "exercicios"

  def create
    @treino_exercicio = TreinoExercicio.new(treino_exercicio_params)
    @treinos = Treino.all
    @exercicios = Exercicio.all

    respond_to do |format|
      if @treino_exercicio.save
---
SELECT "treinos".* FROM "treinos"
SELECT "exercicios".* FROM "exercicios"
INSERT INTO "treino_exercicios" ("serie", "repeticoes", "treino_id", "exercicio_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["serie", 1], ["repeticoes", 4], ["treino_id", 4], ["exercicio_id", 1], ["created_at", "2020-10-13 21:04:41.620480"], ["updated_at", "2020-10-13 21:04:41.620480"]]

  def set_treino_exercicio
    @treino_exercicio = TreinoExercicio.find(params[:id])
---
SELECT "exercicios".* FROM "exercicios" WHERE "exercicios"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "treino_exercicios".* FROM "treino_exercicios" WHERE "treino_exercicios"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]