app/controllers/treinos_controller.rb

  def index
    if current_user.admin? or current_user.professor?
      @treinos = Treino.all
---
SELECT "treinos".* FROM "treinos"

  def new
    @treino = Treino.new
    @usuarios = Usuario.all
---
SELECT "usuarios".* FROM "usuarios"

  def create
    @treino = Treino.new(treino_params)
    @usuarios = Usuario.all
    @treino.professor_id = current_user.id

    respond_to do |format|
      if @treino.save
---
SELECT "usuarios".* FROM "usuarios"
INSERT INTO "treinos" ("tipo_treino", "descricao", "data_inicio", "data_final", "quantidade_dias", "aluno_id", "professor_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def destroy
    @treino.destroy
---
DELETE FROM "treinos" WHERE "treinos"."id" = ?  [["id", 3]]

    def set_treino
      @treino = Treino.find(params[:id])
---
SELECT "treinos".* FROM "treinos" WHERE "treinos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]