app/controllers/treino_exercicios_controller.rb

  def set_treino_exercicio
    @treino_exercicio = TreinoExercicio.find(params[:id])
---
SELECT "exercicios".* FROM "exercicios" WHERE "exercicios"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]