app/controllers/usuarios_controller.rb

  def index
    if current_user.admin?
      @usuarios = Usuario.all
---
SELECT "usuarios".* FROM "usuarios"

  def create
    @usuario = Usuario.new(usuario_params)

    if @usuario.save
---
INSERT INTO "usuarios" ("nome", "email", "telefone", "data_nascimento", "created_at", "updated_at", "password_digest", "tipo") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @usuario.update(usuario_params)
---
UPDATE "usuarios" SET "nome" = ?, "password_digest" = ?, "updated_at" = ? WHERE "usuarios"."id" = ?  [["nome", "KelwinJonas"], ["password_digest", "$2a$12$4tpZZtxdO0gIcaPQHO82o.sIkA3d4ovpQ063BJX3JSUnNnI9E8f1W"], ["updated_at", "2020-10-07 16:15:28.309430"], ["id", 1]]

  def destroy
    if current_user == @usuario
      @usuario.destroy
      sign_out
    else
      @usuario.destroy
---
DELETE FROM "usuarios" WHERE "usuarios"."id" = ?  [["id", 4]]